# LayoutnodeCurvetypeParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LayoutnodeCurvetypeParam Property
ParameterTypeId Class See Also
---
"Curve Type Reference"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LayoutnodeCurvetypeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LayoutnodeCurvetypeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LayoutnodeCurvetypeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace